{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_10", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_10", "batch_input_shape": [32, 1000], "sparse": false}, "name": "input_10", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"input_dim": 52, "embeddings_regularizer": null, "activity_regularizer": null, "output_dim": 52, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "trainable": false, "name": "embedding_10", "mask_zero": true, "embeddings_constraint": null, "batch_input_shape": [32, 1000], "input_length": 1000, "dtype": "int32"}, "name": "embedding_10", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "units": 512, "bias_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "name": "gru_19", "trainable": true, "activation": "tanh", "kernel_constraint": null, "unroll": false, "dropout": 0.0}, "name": "gru_19", "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "rate": 0.2}, "name": "dropout_13", "inbound_nodes": [[["gru_19", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "units": 512, "bias_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "bias_constraint": null, "activity_regularizer": null, "name": "gru_20", "trainable": true, "activation": "tanh", "kernel_constraint": null, "unroll": false, "dropout": 0.0}, "name": "gru_20", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_14", "rate": 0.2}, "name": "dropout_14", "inbound_nodes": [[["gru_20", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_10", "kernel_regularizer": null, "trainable": true, "units": 52, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}}, "name": "time_distributed_10"}, "name": "time_distributed_10", "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}], "output_layers": [["time_distributed_10", 0, 0]], "name": "model_10"}}